In [154]:
# import necessary libraries
import pandas as pd 
import numpy
import mysql.connector
from sqlalchemy import create_engine, text
import pymongo
import os
import datetime
import certifi

In [155]:
host_name = "localhost"
port = "3306"
user_id = "root"
pwd = "catolknepro"

src_dbname = "sakila"
dst_dbname = "sakila_dw"

In [156]:
# mongo cluster
host_name = "localhost"
port = "27017"

atlas_cluster_name = "Cluster0.ntkb6"
atlas_default_dbname = "local"
atlas_user_name = "qxu7tz"
atlas_password = "cwynne"

In [157]:
#mongo cluster
conn_str = {
    "local" : f"mongodb://{host_name}:{port}/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net/{atlas_default_dbname}"
}

client = pymongo.MongoClient(conn_str["atlas"])

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://qxu7tz:cwynne@Cluster0.ntkb6.mongodb.net/local

In [158]:
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        connection.execute(text(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});"))
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

def get_sql_dataframe(sql_query, **args):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{args['uid']}:{args['pwd']}@{args['hostname']}/{args['dbname']}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    dframe = pd.read_sql(text(sql_query), connection);
    connection.close()
    
    return dframe
def get_mongo_client(**args):
    '''Validate proper input'''
    if args["cluster_location"] not in ['atlas', 'local']:
        raise Exception("You must specify either 'atlas' or 'local' for the cluster_location parameter.")
    
    else:
        if args["cluster_location"] == "atlas":
            connect_str = f"mongodb+srv://{args['user_name']}:{args['password']}@"
            connect_str += f"{args['cluster_name']}.{args['cluster_subnet']}.mongodb.net"
            client = pymongo.MongoClient(connect_str, tlsCAFile=certifi.where())
            
        elif args["cluster_location"] == "local":
            client = pymongo.MongoClient("mongodb://localhost:27017/")
        
    return client


def get_mongo_dataframe(mongo_client, db_name, collection, query):
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = mongo_client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    mongo_client.close()
    
    return dframe


def set_mongo_collections(mongo_client, db_name, data_directory, json_files):
    db = mongo_client[db_name]
    
    for file in json_files:
        db.drop_collection(file)
        json_file = os.path.join(data_directory, json_files[file])
        with open(json_file, 'r') as openfile:
            json_object = json.load(openfile)
            file = db[file]
            result = file.insert_many(json_object)
        
    mongo_client.close()

In [159]:
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)
connection = sqlEngine.connect()

connection.execute(text(f"DROP DATABASE IF EXISTS `{dst_dbname}`;"))
connection.execute(text(f"CREATE DATABASE `{dst_dbname}`;"))
connection.execute(text(f"USE {dst_dbname};"))

connection.close()

In [160]:
#
mysql_args = {
    "uid" : "root",
    "pwd" : "catolknepro",
    "hostname" : "localhost",
    "dbname" : "sakila_dw"
}

# The 'cluster_location' must either be "atlas" or "local".
mongodb_args = {
    "user_name" : "qxu7tz",
    "password" : "cwynne",
    "cluster_name" : "Cluster0",
    "cluster_subnet" : "ntkb6",
    "cluster_location" : "atlas", # "local"
    "db_name" : "sakila_customers"
}
src_dbname = "sakila"
db_name = "sakila_dw"
host_name = "localhost"
port = "3306"
user_id = "root"
pwd = "catolknepro"

In [161]:
## IMPORT CSV DATA
data_dir = os.path.join(os.getcwd(), 'Desktop/DS-2002-main')
data_file = os.path.join(data_dir, '/Users/carolinewynne/Desktop/DS-2002-main/SAKILA_DIM_FILM.csv')

df2 = pd.read_csv(data_file, header=0, index_col=0)
df2.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
film_key,,,,,,,,,,,,,
1,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
2,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
4,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
5,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [162]:
# TRANSFORM and MODIFY Columns
# 1. Create a List that enumerates the names of each column you wish to remove (drop) from the Pandas DataFrame
drop_cols = ['original_language_id','special_features', 'last_update', 'replacement_cost']
df2.drop(drop_cols, axis=1, inplace=True)

# 2. Insert a new column, with an ever-incrementing numeric value, to serve as the primary key.
df2.insert(0, "film_key", range(1, df2.shape[0]+1))

# 3. Display the first 2 rows of the dataframe 
df2.head(2)

,film_key,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,rating
film_key,,,,,,,,,,
1,1,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,PG
2,2,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,G

In [163]:
# LOAD 
db_operation = "insert"

tables = [('dim_film', df2, 'film_key')]

In [164]:

for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [165]:
table_name = "dim_film"
primary_key = "film_key"
db_operation = "insert"

set_dataframe(user_id, pwd, host_name, dst_dbname, df2, table_name, primary_key, db_operation)

In [166]:
## MONGO_DB

In [167]:
#populate mongo w/ source data
client = get_mongo_client(**mongodb_args)

# Gets the path of the Current Working Directory for this Notebook,
# and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(),'Desktop/DS-2002-main')

json_file = {"customers" : 'sakila_customers.json'}

set_mongo_collections(client, mongodb_args["db_name"], data_dir, json_file)

In [168]:
#extract
client = get_mongo_client(**mongodb_args)

query = {} # Select all elements (columns), and all documents (rows).
collection = "customers"

df_customer = get_mongo_dataframe(client, mongodb_args["db_name"], collection, query)
df_customer.head(2)

,customer_key,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [229]:
#surrogate primary key that
sql_dim_date = "SELECT date_key, full_date FROM sakila_dw.dim_date;"
df_dim_date = get_sql_dataframe(sql_dim_date, **mysql_args)
df_dim_date.full_date = df_dim_date.full_date.astype('datetime64[ns]').dt.date
df_dim_date.head(2)

   date_key   full_date
0  20000101  2000-01-01
1  20000102  2000-01-02

In [227]:
df_dim_customer = df_dim_date.rename(columns={"date_key" : "create_date_key", "full_date" : "create_date"})
df_customer.create_date = df_customer.create_date.astype('datetime64[ns]').dt.date
df_customer = pd.merge(df_customer, df_dim_customer, on='create_date', how='left')
df_customer.head(2)

,customer_key,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update,create_date_key
0,1,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14,2006-02-15 04:57:20,20060214
1,2,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14,2006-02-15 04:57:20,20060214

In [ ]:
df_customer.drop(['create_date'], axis=1, inplace=True)

In [ ]:
## MODIFY Columns
# 1. Rename the "id" column to reflect the entity as it will serve as the business key for lookup operations
df_customer.rename(columns={"id":"customer_id"}, inplace=True)

# Drop email column as it isn't essential to our business process
df_customer.drop(['email', 'store_id'], axis=1, inplace=True)


df_customer.head(2)

In [ ]:
#LOAD into warehouse
dataframe = df_customer
table_name = 'df_dim_customer'
primary_key = 'customer_key'
db_operation = "insert"

#set_dataframe( dataframe, table_name, primary_key, db_operation, **mysql_args)
set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [ ]:
#VALIDATE
sql_customer = "SELECT * FROM sakila_dw.df_dim_customer;"
df_dim_customer = get_sql_dataframe(sql_customer, **mysql_args)
df_dim_customer.head(2)

In [177]:
## EXTRACT FROM SQL
sql_inventory = "SELECT * FROM sakila.inventory;"
df_inventory = get_dataframe(user_id, pwd, host_name, src_dbname, sql_inventory) # create new variable
df_inventory.head(2)

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 05:09:17
1             2        1         1 2006-02-15 05:09:17

In [179]:
sql_category = "SELECT * FROM sakila.category;"
df_category = get_dataframe(user_id, pwd, host_name, src_dbname, sql_category) # create new variable
df_category.head(2)

   category_id       name         last_update
0            1     Action 2006-02-15 04:46:27
1            2  Animation 2006-02-15 04:46:27

In [181]:
sql_payment = "SELECT * FROM sakila.payment;"
df_payment = get_dataframe(user_id, pwd, host_name, src_dbname, sql_payment) # create new variable
df_payment.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

In [183]:
## TRANSFORM - remove unnecessary columns 
# 1. Create a List that enumerates the names of each column you wish to remove (drop) from the Pandas DataFrame
drop_cols = ['staff_id','last_update']
df_payment.drop(drop_cols, axis=1, inplace=True)

# 2. Insert a new column, with an ever-incrementing numeric value, to serve as the primary key.
df_payment.insert(0, "payment_key", range(1, df_payment.shape[0]+1))

# 3. Display the first 2 rows of the dataframe 
df_payment.head(2)

   payment_key  payment_id  customer_id  rental_id  amount        payment_date
0            1           1            1         76    2.99 2005-05-25 11:30:37
1            2           2            1        573    0.99 2005-05-28 10:35:23

In [185]:
## remembered ids serve as keys for sakila 
df_payment.drop('payment_key', axis =1, inplace = True)
df_payment.head(2)

   payment_id  customer_id  rental_id  amount        payment_date
0           1            1         76    2.99 2005-05-25 11:30:37
1           2            1        573    0.99 2005-05-28 10:35:23

In [187]:
df_category.drop('last_update', axis =1, inplace = True)
df_category.head(2)

   category_id       name
0            1     Action
1            2  Animation

In [189]:
df_inventory.drop('last_update', axis =1, inplace = True)
df_inventory.head(2)

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1

In [191]:
## Load the Transformed DataFrames into the New Data Warehouse by Creating New TablesÂ¶
db_operation = "insert"

tables = [('dim_category', df_category, 'category_id'),
          ('dim_inventory', df_inventory, 'inventory_id'),
         ('dim_payment', df_payment, 'payment_id')]

In [193]:
for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [ ]:
# CREATE AND POPULATE THE FACT RENTAL TABLE with data from tables used (rental, inventory, payment)

In [195]:
sql_rental  = "SELECT * FROM sakila.rental;"
df_rental = get_dataframe(user_id, pwd, host_name, src_dbname, sql_rental)
df_rental.rename(columns={"id":"rental_id"}, inplace=True)
df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

In [148]:
# now we MERGE the tables
df_rental = pd.merge(df_rental, df_inventory, on='inventory_id', how='inner')
df_rental.drop(['inventory_id'], axis=1, inplace=True)
df_rental.head(2)

,rental_id,rental_date,customer_id,return_date,staff_id,last_update_x,film_id,store_id,last_update_y
0,1,2005-05-24 22:53:30,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,80,1,2006-02-15 05:09:17
1,2,2005-05-24 22:54:33,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,333,2,2006-02-15 05:09:17

In [197]:
df_rental = pd.merge(df_rental, df_payment, on='rental_id', how='inner')
df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id_x,return_date,staff_id,last_update,payment_id,customer_id_y,amount,payment_date
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,3504,130,2.99,2005-05-24 22:53:30
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,12377,459,2.99,2005-05-24 22:54:33

In [201]:
df_fact_rental = pd.merge(df_rental, df_inventory, on = 'inventory_id', how = 'right')
df_fact_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id_x,return_date,staff_id,last_update,payment_id,customer_id_y,amount,payment_date,film_id,store_id
0,4863.0,2005-07-08 19:03:15,1,431.0,2005-07-11 21:29:15,2.0,2006-02-15 21:30:53,11630.0,431.0,0.99,2005-07-08 19:03:15,1,1
1,11433.0,2005-08-02 20:13:10,1,518.0,2005-08-11 21:35:10,1.0,2006-02-15 21:30:53,13956.0,518.0,3.99,2005-08-02 20:13:10,1,1

In [203]:
df_fact_rental.drop('customer_id_x', axis = 1, inplace= True)
df_fact_rental.rename(columns = {"customer_id_y":"customer_id"}, inplace = True)
df_fact_rental.head(2)

,rental_id,rental_date,inventory_id,return_date,staff_id,last_update,payment_id,customer_id,amount,payment_date,film_id,store_id
0,4863.0,2005-07-08 19:03:15,1,2005-07-11 21:29:15,2.0,2006-02-15 21:30:53,11630.0,431.0,0.99,2005-07-08 19:03:15,1,1
1,11433.0,2005-08-02 20:13:10,1,2005-08-11 21:35:10,1.0,2006-02-15 21:30:53,13956.0,518.0,3.99,2005-08-02 20:13:10,1,1

In [ ]:
## Look up PRIMARY KEYS in the DIM tables (address, category, customer, film, store, inventory, payment)

In [209]:
#category
sql_dim_category = "SELECT category_id FROM sakila_dw.dim_category;" 
df_dim_category = get_dataframe(user_id,pwd, host_name, src_dbname, sql_dim_category) 
df_dim_category.head(2)

   category_id
0            1
1            2

In [213]:
sql_dim_payment = "SELECT payment_id FROM sakila_dw.dim_payment" 
df_dim_payment = get_dataframe(user_id,pwd, host_name, src_dbname, sql_dim_payment) 
#df_dim_payment.head(2)

In [215]:
sql_dim_inventory = "SELECT inventory_id FROM sakila_dw.dim_inventory;" 
df_dim_inventory = get_dataframe(user_id,pwd, host_name, src_dbname, sql_dim_inventory) 
#df_dim_inventory.head(2)

In [217]:
df_fact_rental.head(2)

,rental_id,rental_date,inventory_id,return_date,staff_id,last_update,payment_id,customer_id,amount,payment_date,film_id,store_id
0,4863.0,2005-07-08 19:03:15,1,2005-07-11 21:29:15,2.0,2006-02-15 21:30:53,11630.0,431.0,0.99,2005-07-08 19:03:15,1,1
1,11433.0,2005-08-02 20:13:10,1,2005-08-11 21:35:10,1.0,2006-02-15 21:30:53,13956.0,518.0,3.99,2005-08-02 20:13:10,1,1

In [ ]:
# use business keys to look up surrogate primary keys in dim tables -> replace date time with date keys

In [231]:
sql_dim_date = "SELECT date_key, full_date FROM sakila_dw.dim_date;"
df_dim_date = get_dataframe(user_id, pwd, host_name, src_dbname, sql_dim_date)
df_dim_date.full_date = df_dim_date.full_date.astype('datetime64[ns]').dt.date
df_dim_date.head(2)

   date_key   full_date
0  20000101  2000-01-01
1  20000102  2000-01-02

In [233]:
## date key for each date typed column (rental_date, payment_date, last_update, return date) 

## rental date
df_dim_rental = df_dim_date.rename(columns={"date_key" : "rental_date_key", "full_date":"rental_date"})
df_fact_rental.rental_date = df_fact_rental.rental_date.astype('datetime64[ns]').dt.date
df_fact_rental = pd.merge(df_fact_rental, df_dim_rental, on='rental_date', how='left')
df_fact_rental.head(2)

,rental_id,rental_date,inventory_id,return_date,staff_id,last_update,payment_id,customer_id,amount,payment_date,film_id,store_id,rental_date_key
0,4863.0,2005-07-08,1,2005-07-11 21:29:15,2.0,2006-02-15 21:30:53,11630.0,431.0,0.99,2005-07-08 19:03:15,1,1,20050708.0
1,11433.0,2005-08-02,1,2005-08-11 21:35:10,1.0,2006-02-15 21:30:53,13956.0,518.0,3.99,2005-08-02 20:13:10,1,1,20050802.0

In [235]:
df_fact_rental.drop(['rental_date'], axis=1, inplace=True)

In [237]:
## payment date
df_dim_payment = df_dim_date.rename(columns={"date_key" : "payment_date_key", "full_date":"payment_date"})
df_fact_rental.payment_date = df_fact_rental.payment_date.astype('datetime64[ns]').dt.date

df_fact_rental = pd.merge(df_fact_rental, df_dim_payment, on='payment_date', how='left')
df_fact_rental.drop(['payment_date'], axis=1, inplace=True)
df_fact_rental.head(2)

,rental_id,inventory_id,return_date,staff_id,last_update,payment_id,customer_id,amount,film_id,store_id,rental_date_key,payment_date_key
0,4863.0,1,2005-07-11 21:29:15,2.0,2006-02-15 21:30:53,11630.0,431.0,0.99,1,1,20050708.0,20050708.0
1,11433.0,1,2005-08-11 21:35:10,1.0,2006-02-15 21:30:53,13956.0,518.0,3.99,1,1,20050802.0,20050802.0

In [239]:
## return date
df_dim_return = df_dim_date.rename(columns={"date_key" : "return_date_key", "full_date":"return_date"})
df_fact_rental.return_date = df_fact_rental.return_date.astype('datetime64[ns]').dt.date

df_fact_rental = pd.merge(df_fact_rental, df_dim_return, on='return_date', how='left')
df_fact_rental.drop(['return_date'], axis=1, inplace=True)
df_fact_rental.head(2)

,rental_id,inventory_id,staff_id,last_update,payment_id,customer_id,amount,film_id,store_id,rental_date_key,payment_date_key,return_date_key
0,4863.0,1,2.0,2006-02-15 21:30:53,11630.0,431.0,0.99,1,1,20050708.0,20050708.0,20050711.0
1,11433.0,1,1.0,2006-02-15 21:30:53,13956.0,518.0,3.99,1,1,20050802.0,20050802.0,20050811.0

In [241]:
#create fact rental key

df_fact_rental.insert(0, "fact_rental_key", range(1, df_fact_rental.shape[0]+1))
#the first 2 rows of the dataframe to validate your work
df_fact_rental.head(2)

,fact_rental_key,rental_id,inventory_id,staff_id,last_update,payment_id,customer_id,amount,film_id,store_id,rental_date_key,payment_date_key,return_date_key
0,1,4863.0,1,2.0,2006-02-15 21:30:53,11630.0,431.0,0.99,1,1,20050708.0,20050708.0,20050711.0
1,2,11433.0,1,1.0,2006-02-15 21:30:53,13956.0,518.0,3.99,1,1,20050802.0,20050802.0,20050811.0

In [243]:
## now write back 
table_name = "fact_rental"
primary_key = "fact_rental_key"
db_operation = "insert"

set_dataframe(user_id, pwd, host_name, dst_dbname, df_fact_rental, table_name, primary_key, db_operation)

In [245]:
## DEMONSTRATE NEW WAREHOUSEWORKS 
sql_test = """
    SELECT 
        categories.`name` AS `Category`,
        SUM(payments.`amount`) AS `Total Revenue`
    FROM sakila.payment AS payments
    INNER JOIN sakila.rental AS rentals 
    ON payments.rental_id = rentals.rental_id
    INNER JOIN sakila.inventory AS inventory 
    ON rentals.inventory_id = inventory.inventory_id
    INNER JOIN sakila.film AS films 
    ON inventory.film_id = films.film_id
    INNER JOIN sakila.film_category AS film_categories 
    ON films.film_id = film_categories.film_id
    INNER JOIN sakila.category AS categories 
    ON film_categories.category_id = categories.category_id
GROUP BY 
    categories.category_id
    ORDER BY `Total Revenue` DESC;

""".format(dst_dbname)

df_test = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)
df_test.head()

    Category  Total Revenue
0     Sports        5314.21
1     Sci-Fi        4756.98
2  Animation        4656.30
3      Drama        4587.39
4     Comedy        4383.58

In [247]:
#most frequent renters and their total duration of rental 
sql_test = """
    SELECT 
        customers.first_name AS `First Name`,
        customers.last_name AS `Last Name`,
        COUNT(rentals.rental_id) AS `Total Rentals`,
        SUM(TIMESTAMPDIFF(DAY, rentals.rental_date, rentals.return_date)) AS `Total Rental Duration (Days)`
FROM 
    sakila.rental AS rentals
INNER JOIN 
    sakila.customer AS customers ON rentals.customer_id = customers.customer_id
INNER JOIN 
    sakila.inventory AS inventory ON rentals.inventory_id = inventory.inventory_id
GROUP BY 
    customers.customer_id
ORDER BY 
    `Total Rentals` DESC;
    """.format(dst_dbname)

df_test = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)
df_test.head()

  First Name Last Name  Total Rentals  Total Rental Duration (Days)
0    ELEANOR      HUNT             46                         218.0
1       KARL      SEAL             45                         241.0
2      CLARA      SHAW             42                         211.0
3     MARCIA      DEAN             42                         187.0
4      TAMMY   SANDERS             41                         171.0

In [249]:
#most frequent renters 
sql_test = """
    SELECT 
        customers.first_name AS `First Name`,
        customers.last_name AS `Last Name`,
        COUNT(rentals.rental_id) AS `Total Rentals`
FROM 
    sakila.rental AS rentals
INNER JOIN 
    sakila.customer AS customers ON rentals.customer_id = customers.customer_id
INNER JOIN 
    sakila.inventory AS inventory ON rentals.inventory_id = inventory.inventory_id
GROUP BY 
    customers.customer_id
ORDER BY 
    `Total Rentals` DESC;
    """.format(dst_dbname)

df_test = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)
df_test.head()

  First Name Last Name  Total Rentals
0    ELEANOR      HUNT             46
1       KARL      SEAL             45
2      CLARA      SHAW             42
3     MARCIA      DEAN             42
4      TAMMY   SANDERS             41